load_test.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - flow:
      - post:
          url: "/graphql"
          json:
            query: "mutation { createUser(username: \"testuser${__VU}\", password: \"testpass\") { username balance } }"
      - think: 1
      - post:
          url: "/graphql"
          json:
            query: "mutation { deposit(username: \"testuser${__VU}\", amount: 100.00) { balance } }"
      - think: 1
      - post:
          url: "/graphql"
          json:
            query: "query { getBalance(username: \"testuser${__VU}\", password: \"testpass\") }"